---
kind: type
id: T:Autodesk.Revit.UI.RibbonItemType
source: html/12cf9be6-78be-2162-3a42-84dcb3abbd57.htm
---
# Autodesk.Revit.UI.RibbonItemType

An enumerated type listing all the toolbar item styles.

## Syntax (C#)
```csharp
public enum RibbonItemType
```